Turinco/sabre/WS_SsoftSabreV2/WS_SsoftSabre/Web References/SessionCreateRQ/SessionCreateRQ.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:tns="https://webservices.sabre.com/websvc" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:xsd1="http://www.opentravel.org/OTA/2002/11" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" targetNamespace="https://webservices.sabre.com/websvc" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import schemaLocation="SessionCreateRQRS.xsd" namespace="http://www.opentravel.org/OTA/2002/11" />
      <xsd:import schemaLocation="msg-header-2_0.xsd" namespace="http://www.ebxml.org/namespaces/messageHeader" />
      <xsd:import schemaLocation="xmldsig-core-schema.xsd" namespace="http://www.w3.org/2000/09/xmldsig#" />
      <xsd:import schemaLocation="xlink.xsd" namespace="http://www.w3.org/1999/xlink" />
      <xsd:import schemaLocation="envelope.xsd" namespace="http://schemas.xmlsoap.org/soap/envelope/" />
      <xsd:import schemaLocation="xml.xsd" namespace="http://www.w3.org/XML/1998/namespace" />
      <xsd:import schemaLocation="wsse.xsd" namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" />
    </xsd:schema>
  </types>
  <message name="GetSessionCreateInput">
    <part name="header" element="eb:MessageHeader" />
    <part name="header2" element="wsse:Security" />
    <part name="body" element="xsd1:SessionCreateRQ" />
  </message>
  <message name="GetSessionCreateOutput">
    <part name="header" element="eb:MessageHeader" />
    <part name="header2" element="wsse:Security" />
    <part name="body" element="xsd1:SessionCreateRS" />
  </message>
  <portType name="SessionCreatePortType">
    <operation name="SessionCreateRQ">
      <input message="tns:GetSessionCreateInput" />
      <output message="tns:GetSessionCreateOutput" />
    </operation>
  </portType>
  <binding name="SessionCreateSoapBinding" type="tns:SessionCreatePortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="SessionCreateRQ">
      <soap:operation soapAction="OTA" />
      <input>
        <soap:header message="tns:GetSessionCreateInput" part="header" use="literal" />
        <soap:header message="tns:GetSessionCreateInput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </input>
      <output>
        <soap:header message="tns:GetSessionCreateOutput" part="header" use="literal" />
        <soap:header message="tns:GetSessionCreateOutput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </output>
    </operation>
  </binding>
  <service name="SessionCreateRQService">
    <port name="SessionCreatePortType" binding="tns:SessionCreateSoapBinding">
      <soap:address location="https://webservices.sabre.com/websvc" />
    </port>
  </service>
</definitions>